In [14]:
import sqlite3 as sql
import pandas as pd

# Load DB Files into SQLite Database

In [13]:
srpt = open('./data/sqlitesampledatabase.sql', 'r').read()
conn = sql.connect('./classicmodels.db') #sqlite creates new db if not available
c = conn.cursor()
c.executescript(srpt)
conn.commit()
c.close()
conn.close()

# Reading with pandas

In [15]:
#Connecting to now populated database
conn = sql.connect('./classicmodels.db')

In [16]:
#Write query to show tables. We read a meta data master file and get the names
qry = "SELECT name FROM sqlite_master WHERE type='table';"

#pandas makes it easier to read the query using the connection
#will print automatically

pd.read_sql_query(qry,conn)

           name
0     customers
1     employees
2       offices
3  orderdetails
4        orders
5      payments
6  productlines
7      products

In [17]:
#query to get first few office records from table
qry2 = 'select * from offices limit 10'
pd.read_sql_query(qry2,conn)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy Dabbans,None,None,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
6,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA

In [18]:
#query to get first few employee records from table
qry3 = 'select * from employees limit 10'
pd.read_sql_query(qry3,conn)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep

In [20]:
#query to find employee phone numbers
#note '\' backslash escape on line breaks for formatting
qry4 = 'select e.lastName, e.firstName, o.phone\
    from employees as e inner join offices as o\
    where e.officeCode == o.officeCode\
    limit 10'
pd.read_sql_query(qry4,conn)

    lastName firstName            phone
0     Murphy     Diane  +1 650 219 4782
1  Patterson      Mary  +1 650 219 4782
2   Firrelli      Jeff  +1 650 219 4782
3  Patterson   William  +61 2 9264 2451
4     Bondur    Gerard  +33 14 723 4404
5        Bow   Anthony  +1 650 219 4782
6   Jennings    Leslie  +1 650 219 4782
7   Thompson    Leslie  +1 650 219 4782
8   Firrelli     Julie  +1 215 837 0825
9  Patterson     Steve  +1 215 837 0825